In [1]:
import pandas as pd
import seaborn as sns
import matplotlib as plt

In [2]:
# Read scraped data file into Pandas
data_df = pd.read_csv('akdor_oil_production.csv')

C:\Users\diane\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3441: DtypeWarning: Columns (1,2,3,4,5,6,7) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
data_df = data_df.rename(columns={'1':'PrudhoeBay','2':'Kuparuk','3':'Endicott','4':'Lisburne','5':'Alpine', '6':'ANS','7':'Inventories'})

In [4]:
data_df.head()

       Date PrudhoeBay Kuparuk Endicott Lisburne Alpine     ANS Inventories
0  9/1/2021     292022   88063        0    21068  49002  450155     1623874
1  9/2/2021     298546   92461        0    20472  48452  459930     1530847
2  9/3/2021     289929   94146        0    18449  47901  450424     1234895
3  9/4/2021     296408   94549        0    18157  47449  456562     1624191
4  9/5/2021     298994   94469        0    20177  47702  461343     1388480

In [5]:
data_df = data_df.drop(['ANS', 'Inventories'], axis=1)
data_df = data_df[data_df["Date"].str.contains("Date")==False]
data_df['Date']= pd.to_datetime(data_df['Date'])
data_df.dropna(how='any')
data_df.head()

        Date PrudhoeBay Kuparuk Endicott Lisburne Alpine
0 2021-09-01     292022   88063        0    21068  49002
1 2021-09-02     298546   92461        0    20472  48452
2 2021-09-03     289929   94146        0    18449  47901
3 2021-09-04     296408   94549        0    18157  47449
4 2021-09-05     298994   94469        0    20177  47702

In [6]:
# found help here: https://dfrieds.com/data-analysis/melt-unpivot-python-pandas.html
data_df = data_df.melt(id_vars=['Date'], var_name='Field', value_name='Volume')
data_df.head()

        Date       Field  Volume
0 2021-09-01  PrudhoeBay  292022
1 2021-09-02  PrudhoeBay  298546
2 2021-09-03  PrudhoeBay  289929
3 2021-09-04  PrudhoeBay  296408
4 2021-09-05  PrudhoeBay  298994

In [7]:
data_df['Volume'] = pd.to_numeric(data_df['Volume'],errors='coerce')
data_df.head()

        Date       Field    Volume
0 2021-09-01  PrudhoeBay  292022.0
1 2021-09-02  PrudhoeBay  298546.0
2 2021-09-03  PrudhoeBay  289929.0
3 2021-09-04  PrudhoeBay  296408.0
4 2021-09-05  PrudhoeBay  298994.0

In [8]:
data_df = data_df.set_index('Date')
data_df.head()

                 Field    Volume
Date
2021-09-01  PrudhoeBay  292022.0
2021-09-02  PrudhoeBay  298546.0
2021-09-03  PrudhoeBay  289929.0
2021-09-04  PrudhoeBay  296408.0
2021-09-05  PrudhoeBay  298994.0

In [9]:
data_df.columns

Index(['Field', 'Volume'], dtype='object')

In [10]:
data_df.to_csv(r'C:\Users\diane\OneDrive\Documents\My Tableau Repository\Datasources\clean_akoilprod_data.csv')